leon/constant/trisurface/sueloCiudad.mtl
# WaveFront *.mtl file (generated by Autodesk ATF)

newmtl 191,191,191
Ka 0.749020 0.749020 0.749020
Kd 0.749020 0.749020 0.749020
Ks 0.000000 0.000000 0.000000
Ns 300.000000
d 1.000000

